In this document I'll be touching very quickly on the basics of git.

** Checkout
Once you have cloned a repo you can checkout branches that exist within the repo. Lets say that "someproject123" had versioned branches. It might have master, 1.0 and 1.1. With git checkout you can get checkout different branches.

You can use the below command to explore what branches are available.
#+begin_src sh :results output
git branch -a
#+end_src

#+RESULTS:
: * master
:   remotes/origin/HEAD -> origin/master
:   remotes/origin/master

To change between branches use the below command
#+begin_src sh
git checkout -b nameOfRemoteBranch nameOfLocalBranch
#+end_src
Within git you have remote branches and local branches. We'll be talking about those later. 

** Status
Status will show you what is changes are currently staged or unstaged

#+begin_src sh :results output
git status
#+end_src

#+RESULTS:
#+begin_example
On branch master
Your branch is up-to-date with 'origin/master'.

Changes not staged for commit:
  (use "git add/rm <file>..." to update what will be committed)
  (use "git checkout -- <file>..." to discard changes in working directory)

	deleted:    ../c++/ldopen.org
	modified:   ../sh/unixFifoFiles.org
	modified:   ../todo.org

Untracked files:
  (use "git add <file>..." to include in what will be committed)

	../.gitignore~
	../c++/dlopen.org
	../c++/sTemplateExpression.org
	../c++/sTemplateExpression.org~
	../dedication.org~
	../emacs/##emacs.org##
	../emacs/emacs.org~
	./
	../index.org~

no changes added to commit (use "git add" and/or "git commit -a")
#+end_example

